Revit 2026 API

# FormulaManager Properties

---

The FormulaManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FormulaManager Class

Autodesk.Revit.DB Namespace